#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/private-henrique-percu/ecs-service-deploy/runs/run-2KNfJz4NHeHm5CPs

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_iam_role.ecs_task_execution_role: Refreshing...
data.aws_caller_identity.current: Refreshing...
data.aws_region.current: Refreshing...
data.aws_ecs_cluster.ecs_cluster: Refreshing...
data.aws_region.current: Refresh complete after 0s [id=us-west-2]
data.aws_caller_identity.current: Refresh complete after 0s [id=689210545704]
data.aws_iam_role.ecs_task_execution_role: Refresh complete after 0s [id=ecsTaskExecutionRole]
aws_ecs_task_definition.demo_container_application_task_definition: Refreshing state... [id=demo_container_application_family]
data.aws_ecs_cluster.ecs_cluster: Refresh complete after 0s [id=arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-west-2:689210545704:service/demo_ecs_cluster/demo_containerized_app]
aws_ecs_task_definition.demo_container_application_task_definition: Drift detected (update)
aws_ecs_service.main: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 0 -> 1
        id                                 = "arn:aws:ecs:us-west-2:689210545704:service/demo_ecs_cluster/demo_containerized_app"
        name                               = "demo_containerized_app"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:689210545704:task-definition/demo_container_application_family:3" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.demo_container_application_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "demo_container_application_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-west-2:689210545704:task-definition/demo_container_application_family:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - essential        = true
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "default_log_group"
                          + awslogs-region        = "us-west-2"
                          + awslogs-stream-prefix = "app"
                        }
                    }
                  - mountPoints      = []
                    name             = "demo_containerized_app"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "demo_container_application_family" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```
</details>
*Pushed by: @HenriquePercu, Action: `pull_request`*